performance-tests/results/Health_Check_Baseline_20251003_163702.txt

Summary:
  Total:	1.7477 secs
  Slowest:	0.2542 secs
  Fastest:	0.0008 secs
  Average:	0.0168 secs
  Requests/sec:	572.1666
  
  Total data:	44970 bytes
  Size/request:	44 bytes

Response time histogram:
  0.001 [1]	|
  0.026 [885]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.051 [102]	|■■■■■
  0.077 [3]	|
  0.102 [1]	|
  0.127 [1]	|
  0.153 [1]	|
  0.178 [2]	|
  0.203 [1]	|
  0.229 [1]	|
  0.254 [2]	|


Latency distribution:
  10% in 0.0057 secs
  25% in 0.0088 secs
  50% in 0.0141 secs
  75% in 0.0203 secs
  90% in 0.0270 secs
  95% in 0.0331 secs
  99% in 0.0710 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0008 secs, 0.2542 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0103 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0025 secs
  resp wait:	0.0165 secs, 0.0007 secs, 0.2383 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0148 secs

Status code distribution:
  [200]	99 responses
  [429]	901 responses