performance-tests/results/Health_Check_Baseline_20251003_193512.txt

Summary:
  Total:	1.3264 secs
  Slowest:	0.4205 secs
  Fastest:	0.0016 secs
  Average:	0.0636 secs
  Requests/sec:	75.3894
  
  Total data:	7200 bytes
  Size/request:	72 bytes

Response time histogram:
  0.002 [1]	|■
  0.044 [62]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.085 [27]	|■■■■■■■■■■■■■■■■■
  0.127 [0]	|
  0.169 [0]	|
  0.211 [0]	|
  0.253 [0]	|
  0.295 [2]	|■
  0.337 [1]	|■
  0.379 [2]	|■
  0.421 [5]	|■■■


Latency distribution:
  10% in 0.0118 secs
  25% in 0.0154 secs
  50% in 0.0305 secs
  75% in 0.0503 secs
  90% in 0.2678 secs
  95% in 0.4052 secs
  99% in 0.4205 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0011 secs, 0.0016 secs, 0.4205 secs
  DNS-lookup:	0.0009 secs, 0.0000 secs, 0.0196 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0614 secs, 0.0014 secs, 0.4204 secs
  resp read:	0.0007 secs, 0.0000 secs, 0.0270 secs

Status code distribution:
  [200]	100 responses