performance-tests/results/User_Registration_20251003_193512.txt

Summary:
  Total:	0.2330 secs
  Slowest:	0.0610 secs
  Fastest:	0.0007 secs
  Average:	0.0089 secs
  Requests/sec:	214.6041
  
  Total data:	2100 bytes
  Size/request:	42 bytes

Response time histogram:
  0.001 [1]	|■
  0.007 [28]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.013 [12]	|■■■■■■■■■■■■■■■■■
  0.019 [7]	|■■■■■■■■■■
  0.025 [0]	|
  0.031 [0]	|
  0.037 [0]	|
  0.043 [0]	|
  0.049 [0]	|
  0.055 [1]	|■
  0.061 [1]	|■


Latency distribution:
  10% in 0.0024 secs
  25% in 0.0039 secs
  50% in 0.0054 secs
  75% in 0.0114 secs
  90% in 0.0164 secs
  95% in 0.0490 secs
  0% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0003 secs, 0.0007 secs, 0.0610 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0024 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0081 secs, 0.0006 secs, 0.0459 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0056 secs

Status code distribution:
  [429]	50 responses